---
kind: enumMember
id: F:Autodesk.Revit.DB.Structure.AnalyticalProjectionType.AutoDetect
enum: Autodesk.Revit.DB.Structure.AnalyticalProjectionType
source: html/7b5de664-1e5e-8097-e5f6-a6d063f23612.htm
---
# Autodesk.Revit.DB.Structure.AnalyticalProjectionType.AutoDetect

Auto-detect projections for analytical model.